tutorials/basic/simpleFoam/implicitAMI/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    AMI1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          5;
        startFace       32;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          7;
        startFace       37;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    top
    {
        type            patch;
        nFaces          4;
        startFace       44;
    }
    bottom
    {
        type            patch;
        nFaces          4;
        startFace       48;
    }
    left
    {
        type            patch;
        nFaces          5;
        startFace       52;
    }
    right
    {
        type            patch;
        nFaces          7;
        startFace       57;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          48;
        startFace       64;
    }
)

// ************************************************************************* //
